<?php

/**
 * Created by Xie.
 * User: DELL
 * Date: 2019/3/11
 * Time: 9:17
 */

namespace app\definition;

class CodeMes{

    # 自定义错误返回码
    public static $errorCode = [
        0       => '获取数据成功',
        3001    => '请求方法不正确',
        3002    => '验证未通过',
        3003    => '添加失败',
        3004    => '没有查询到',
        3005    => '用户不存在',
        3006    => '请求参数有误',
        3008    => '俱乐部人数已满',
        3009    => '查询的俱乐部不存在',
        3010    => '领取会员卡失败',
        3011    => '领取钻石或金币失败',
        3012    => '该工会不存在',
        3015    => '您已加入该俱乐部',
        3016    => '修改招募文件失败',
        3017    => '数据插入失败',
        3018    => 'session写入失败',
        3019    => '没有邮件',
        3201    => '玩家钻石不足',
        3300    => '还没加入俱乐部呢',
        3999    => '没有此玩法相关数据',
        3998    => '查询数据库失败',
        3400    => 'http请求错误！',
        3000    => '请求成功',
        3401    => '获取去数据异常',
        3402    => '数据不存在',
        9999    => '请重新登陆',
        1111    => '服务器内部错误',
        23202   => '房间不存在',
        23203   => '房间已存在',
        23204   => '房间已满',
        23206   => '创建房间成功',
        23004   => '进入失败,没有加入该俱乐部',
        23005   => '没有符合此条件的俱乐部',
        23402   => '您是本亲友圈会长,不能退出亲友圈',
        23403   => '没有商品',


        # 谢百川专用
        -10000 => '系统繁忙',
        3500 => '俱乐部不存在',
        3501 => '房间玩法不存在',
        3502 => '该俱乐部没有此房间玩法',
        3503 => '玩法解析错误',
        3504 => '房间计费模式解析错误',
        3505 => '房间不存在',
        3506 => '加入房间失败',
        3507 => '解散房间成功',
        3508 => '解散房间失败',
        3509 => '玩家不在房间',
        3510 => '退出房间成功',
        3511 => '没有加入此俱乐部',
        3512 => '没有此类型的vip卡',
        3513 => '使用vip卡失败',
        3514 => '没有此类型的vip卡',
        3515 => '使用vip卡成功',
        3516 => '钻石不足',
        40002 => '钻石不足',
        3517 => '创建房间失败',
        3518 => '房间信息不存在',
        3519 => '已经在房间',
        3520 => '俱乐部所属地区不存在',
        3521 => '没有可用服务器',
        # 海选
        3522 => '不是报名时间',
        3523 => '操作过于频繁',

        #推广员模式专用
        3600 => '已绑定上级id',
        3601 => '邀请人id不存在',
        3602 => '获取用户资产失败',
        3603 => '红包券不足',
        3604 => '红包券提现失败',
        3605 => '没有达到兑换条件',
        3606 => '没有达到提现条件',
        3607 => '没有配置领取红包完成圈数',
        3608 => '修改俱乐部红包池失败',
        3609 => '获取俱乐部设置信息',
        3610 => '您输入的内容太多，超过输入上限！',

    ];
}
